# Καλημερες. νομιζω ειμαστε στην τελικη ευθεια και πρεπει να φτιαξουμε το reinforcement learning neural network asap.
# Κατω γραφω σε γενικες γραμμες σε abstract μορφη μια κλαση BotML εχω links για καθε τι που χρειαζεστε για να καταλαβετε τι γινεται,
# η που πρεπει να κανω περισσοτερο research

#προτεινω να χρησιμοποιησουμε pytorch επειδη ειναι η πιο γνωστη βιβλιοθηκη για το reinforcement learning και εχει πολυ καλη υποστηριξη απο την κοινοτητα

# Τι θαα κανουμε σε γενικες γραμμες: 
# 1. τα δεδομενα μας θα τα μετατρεψουμε σε tensors (ειναι ενα data structure που χρησιμοποιει το pytorch για να κανει υπολογισμους με GPU)
# 2. θα φτιαξουμε ενα neural network το οποιο θα εχει 3 (?, 3 το λιγοτερο) layers (input, hidden, output). Θα βαζουμε τενσορα boardstate και θα μας επιστρεφει κινηση (εμβαθυνω αργοτερα)
# 3. θα βαλουμε τα nn μας να παιζουν μεταξυ τους. αυτο που θα κερδιζει θα το επιβραβευουμε και αυτο που θα χανει θα το τιμωρουμε.
# 4. μετα απο αρκετα iterations θα μπορει να κανει evaluate ta boards με αρκετη ακριβεια και να παιζει καλα.

# γιια να εχετε μια εικονα τι θα εξηγησω μετα
#https://raw.githubusercontent.com/mrdbourke/pytorch-deep-learning/main/images/01_a_pytorch_workflow.png


import numpy as np #κλασικα
import random
from abc import ABC, abstractmethod

import torch
import torch.nn as nn
import torch.nn.functional as F
import torch.optim as optim #με την σειρα εχουμε το pytorch, pytorch για newral network, functional για να χρησιμοποιησουμε τις συναρτησεις 
                            #του pytorch (loss functions κλπ) και το optim για να κανουμε optimization στο neural network μας. εμβαθυνω αργοτερα

class BotML(ABC):

    @abstractmethod
    def board_to_tensors(self):
        # εδω θα μετατρεψουμε το board σε tensor
        # εχει λιγη κουβεντα εδω να αποφασισουμε τι θελουμε να ταιζουμε στο bot μας
        # 
        # θελουμε να του δινουμε το board state και να μας επιστρεφει την κινηση που θα κανει στυλ (1,1,2,2) που θα σημαινει κουνα το πιονι που βρισκεται στο 1,1 στο 2,2?
        # αυτο θα μας ταλαιπωρησει στο training αρα δεν το συνηστω
        # 
        # θελουμε να του δινουμε ολες τις πιθανες κινησεις ταυτοχρονα και να μας λεει ποια του αρεσει περισσοτερο? 
        # δηλαδη θα του δινουμε τα children του boardnode μας (πχ 4 children/κινησεις) και θα μας επιστρεφει (0.02,0.1,0.2,0.58) (αθροιζουν 1), αρα ειναι 58% σιγουρο οτι η τεταρτη κινηση ειναι η καλυτερη
        # αυτο θα μας ταλαιπωρησει στα nodes μας επειδη δεν ξερω ακομα πως θα δομουσα κατι τετοιο

        # το πιο πιθανο που βλεπω να κανουμε ειναι να του δινουμε μια μια τις κινησεις και να μας λεει αν του αρεσει η οχι
        # δηλαδη του δινουμε ενα ενα τα children και παιρνουμε ενα νουμερακι για το καθενα (0.2) (0.84) (0.45) (0.02), αρα προτιμαται το δευτερο child απο τις πιθανες κινησεις
        # αυτο ειναι καττα την γνωμη μου πιο ευκολο και δεν θα μας ταλαιπωρησει τοσο πολυ στο training
        pass

    @abstractmethod
    def __init__(self):
        pass

    # (εβαλα την init πιο κατω για να εχει ροη το κειμενο που γραφω τωρα)
    # ηρθε η ωρα να συζητησουμε την δομη του νευρωνικου δικτυου.
    # αν αποφασισουμε στο τελευταιο (στο να δινουμε μια μια τις κινησεις) περιμενουμε ενα νουμερο σαν αποτελεσμα, αρα χρειαζομαστε ενα output node
    # για εισοδους προτεινω 4, θα εχουμε 4 tensors (enemy pieces, enemy kings, our pieces, our kings) και το νν μας θα τα επεξεργαζεται στα hidden layers του
    # τον τυπο των layers θα τον κανω περισσοτερο research. αν θα ειναι linear, conv2d η κατι αλλο
    
    # newral network diagram να το εχετε λιγο εικονα
    #https://www.researchgate.net/publication/323312622/figure/fig3/AS:645600408256513@1530934540411/Workflow-diagram-of-the-artificial-neural-network-algorithm-developed-by-Lancashire-et.png

    #documentation για layer types
    # https://pytorch.org/docs/stable/nn.html#linear-layers
    # https://pytorch.org/docs/stable/nn.html#convolution-layers


    ## ωραια, καναμε το board tensors, το βαλαμε στο nn μας και μας επεστρεψε ενα νουμερο
    # αυτο το νουμερο δεν εχει κανενα νοημα επειδη βγηκε τυχαια, πρεπει να το εκπαιδευσουμε

    # δεν εχουμε data, θα φτιαξουμε δικα μας μεσω του training model μας
    
    @abstractmethod
    def train(model, optimizer, episodes=1000):
        pass

    #ποιο θα ειναι το loop:
    # για 1000 φορες: παιξε ενα παιχνιδι με τον εαυτο σου (πιθανον να καλει συναρτηση self_play_game)
    # θα επιλεγει κινησεις μεχρι μια πλευρα να χασει μια να κερδισει. Οι κινησεις θα αποθηκευονται σε δυο arrays
    # οι κινησεις του χαμενου μαρκαρονται ως μη επιθυμητες (negative reward) και οι κινησεις του νικητη ως επιθυμητες (positive reward), ισοπαλιες δεν κερδιζει κανενας
    # συγχαρητηρια, φτιαξαμε το πρωτο μας loss function (εχασες κερδισες το παιχνιδι) και κατα προεκταση training set (κινησεις που κατεληξαν σε νικη η ηττα)

    # χρειαζομαστε και ενα optimizer για να κανουμε update τα weights του νευρωνικου δικτυου μας 
    # optimizer θα χρησιμοποιησουμε τα built in του pytorch, λογικα το adam. θελω παραπανω research 
    # https://pytorch.org/docs/stable/optim.html#algorithms


    # αυτα ειναι τα must have methods. τωρα μπορει να εμφανιστουν εξτρα οπως το self play game, ετσι και ενα get_move αφου το κανουμε train

    # GAME PLAN:
    #κυριακη επιστρεφω πατρα, βαζω dualboot linux στο pc για να μπορω να χρησιμοποιησω την καρτα γραφικων μου (θενξ windows και amd)
    # δευτερα πρωι ψαχνω τα σημεια που ειπα οτι θελουν παραπανω research μεχρι να παω για ενα εργαστηριο που εχω
    # δευτερα απογευμα αρχιζω να φτιαχνω το νευρωνικο δικτυο και αν πανε ολα καλα να το εκπαιδευω
    # τριτη δεν θα πατησω σχολη να κανω complete & debug γενικα.
    # τεταρτη εχουμε μια μερα ξτρα αν δεν πανε ολα οσο μελι γαλα οσο τα περιγραφω πανω.
    
    # θα βγει το πιστευω. παω για παρτι :)

    #που τα μελετησα ολα αυτα κυριως (μπορειτε να βρειτε μικροτερα τουτοριαλς εσεις):
    #https://youtu.be/LyJtbe__2i0?si=byvjFt4tNeSrrXRA
